In [1]:
# import the libraries
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv('Social_Network_Ads.csv')

In [3]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [4]:
df.tail()

      User ID  Gender  Age  EstimatedSalary  Purchased
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

In [5]:
df.shape

(400, 5)

In [7]:
# drop USwer ID Column
df.drop(columns=['User ID'], inplace=True)

In [8]:
df.head()

   Gender  Age  EstimatedSalary  Purchased
0    Male   19            19000          0
1    Male   35            20000          0
2  Female   26            43000          0
3  Female   27            57000          0
4    Male   19            76000          0

In [9]:
df.isnull().sum()

Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Gender           400 non-null    object
 1   Age              400 non-null    int64
 2   EstimatedSalary  400 non-null    int64
 3   Purchased        400 non-null    int64
dtypes: int64(3), object(1)
memory usage: 12.6+ KB

In [11]:
# Using replace function to encode categorical column to numerical column
df['Gender'].replace({'Male':1, 'Female':0}, inplace=True)

In [12]:
df.head()

   Gender  Age  EstimatedSalary  Purchased
0       1   19            19000          0
1       1   35            20000          0
2       0   26            43000          0
3       0   27            57000          0
4       1   19            76000          0

In [13]:
# Split dataset into x and Y
x=df.iloc[:,:3]
x

     Gender  Age  EstimatedSalary
0         1   19            19000
1         1   35            20000
2         0   26            43000
3         0   27            57000
4         1   19            76000
..      ...  ...              ...
395       0   46            41000
396       1   51            23000
397       0   50            20000
398       1   36            33000
399       0   49            36000

[400 rows x 3 columns]

In [14]:
y=df.Purchased

In [15]:
y

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

In [16]:
# Scaling
from sklearn.preprocessing import scale
x_scaled=pd.DataFrame(scale(x))

In [17]:
x_scaled

            0         1         2
0    1.020204 -1.781797 -1.490046
1    1.020204 -0.253587 -1.460681
2   -0.980196 -1.113206 -0.785290
3   -0.980196 -1.017692 -0.374182
4    1.020204 -1.781797  0.183751
..        ...       ...       ...
395 -0.980196  0.797057 -0.844019
396  1.020204  1.274623 -1.372587
397 -0.980196  1.179110 -1.460681
398  1.020204 -0.158074 -1.078938
399 -0.980196  1.083596 -0.990844

[400 rows x 3 columns]

In [18]:
# Train and test Split
from sklearn.model_selection import train_test_split

In [21]:
x_train,x_test,y_train,y_test=train_test_split(x_scaled,y ,test_size=0.2,random_state=0)

In [22]:
x_train.shape

(320, 3)

In [23]:
x_test.shape

(80, 3)

In [24]:
# Model Building
from sklearn.linear_model import LogisticRegression

In [25]:
lr=LogisticRegression()

In [26]:
#fitting the model
lr.fit(x_train,y_train)

LogisticRegression()

In [27]:
#Prediction
pred1=lr.predict(x_test)

In [28]:
pred1

array([0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1,
       0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1], dtype=int64)

In [29]:
y_test

132    0
309    0
341    0
196    0
246    0
      ..
14     0
363    0
304    0
361    1
329    1
Name: Purchased, Length: 80, dtype: int64

In [30]:
from sklearn.metrics import accuracy_score, classification_report, confusion_matrix

In [34]:
accuracy_score(y_test,pred1)

0.9125

In [37]:
confusion_matrix(y_test,pred1)

array([[56,  2],
       [ 5, 17]], dtype=int64)

In [38]:
print(classification_report(y_test, pred1))

              precision    recall  f1-score   support

           0       0.92      0.97      0.94        58
           1       0.89      0.77      0.83        22

    accuracy                           0.91        80
   macro avg       0.91      0.87      0.89        80
weighted avg       0.91      0.91      0.91        80